# dotfiles必須パッケージ

# === 開発ツール ===
brew "gh"              # GitHub CLI
brew "git-delta"        # Git diff表示改善
brew "git-filter-repo"  # Git履歴操作
brew "wget"            # ダウンロードツール

# === エディタ・検索 ===
brew "vim"                    # メインエディタ
brew "ripgrep"               # 高速検索 (.vim設定で使用)
brew "the_silver_searcher"   # 高速検索 (.vim設定で使用)

# === シェル・ターミナル ===
brew "tmux"            # ターミナルマルチプレクサ
brew "direnv"          # ディレクトリ環境変数 (.zsh設定で使用)

# === 文字コード・セキュリティ ===
brew "nkf"             # 文字コード変換
brew "openssl@3"       # SSH/RSA鍵生成

# === 画像処理・AI連携 ===
brew "imagemagick"     # 画像前処理
brew "tesseract"       # OCR (AI連携用)

# === クラウド・コンテナ ===
brew "gcloud-cli"      # GCP CLI
brew "google-cloud-sdk" # GCP SDK
brew "docker"          # コンテナ開発
cask "docker-desktop"  # Docker GUI

# === GUI アプリケーション ===
cask "iterm2"          # メインターミナル

# === オプション (必要時に有効化) ===
# brew "openjdk"       # Minecraft/MOD用